4) /Users/user/www_personal/demo_mutant_fail/src/FooZero.php:5    [M] PublicVisibility
--- Original
+++ New
@@ @@
 
 class FooZero
 {
-    public function zero(int $a) : int
+    protected function zero(int $a) : int
     {
         return $a * 0;
     }
 }
PHPUnit 7.1.4 by Sebastian Bergmann and contributors.

Runtime:       PHP 7.2.4
Configuration: /private/var/folders/vm/4njclq0551gfx1q36d_syk7sfhkp5k/T/infection/phpunitConfiguration.7d8f63aab87b536cc0a99bc907c4e987.infection.xml

.                                                                   1 / 1 (100%)

Time: 21 ms, Memory: 4.00MB

OK (1 test, 1 assertion)
